In [2]:
import pandas as pd

In [5]:
# 데이터셋 불러오기
df = pd.read_csv('data/gapminder.tsv', sep='\t')

In [125]:
#df[df['country']=='Korea, Rep.']
# Korea라는 단어가 들어있는 국가 추출
df[df['country'].str.contains('Korea')]

              country continent  year  lifeExp       pop     gdpPercap
828  Korea, Dem. Rep.      Asia  1952   50.056   8865488   1088.277758
829  Korea, Dem. Rep.      Asia  1957   54.081   9411381   1571.134655
830  Korea, Dem. Rep.      Asia  1962   56.656  10917494   1621.693598
831  Korea, Dem. Rep.      Asia  1967   59.942  12617009   2143.540609
832  Korea, Dem. Rep.      Asia  1972   63.983  14781241   3701.621503
833  Korea, Dem. Rep.      Asia  1977   67.159  16325320   4106.301249
834  Korea, Dem. Rep.      Asia  1982   69.100  17647518   4106.525293
835  Korea, Dem. Rep.      Asia  1987   70.647  19067554   4106.492315
836  Korea, Dem. Rep.      Asia  1992   69.978  20711375   3726.063507
837  Korea, Dem. Rep.      Asia  1997   67.727  21585105   1690.756814
838  Korea, Dem. Rep.      Asia  2002   66.662  22215365   1646.758151
839  Korea, Dem. Rep.      Asia  2007   67.297  23301725   1593.065480
840       Korea, Rep.      Asia  1952   47.453  20947571   1030.592226
841       Korea, Rep.      Asia  1957   52.681  22611552   1487.593537
842       Korea, Rep.      Asia  1962   55.292  26420307   1536.344387
843       Korea, Rep.      Asia  1967   57.716  30131000   2029.228142
844       Korea, Rep.      Asia  1972   62.612  33505000   3030.876650
845       Korea, Rep.      Asia  1977   64.766  36436000   4657.221020
846       Korea, Rep.      Asia  1982   67.123  39326000   5622.942464
847       Korea, Rep.      Asia  1987   69.810  41622000   8533.088805
848       Korea, Rep.      Asia  1992   72.244  43805450  12104.278720
849       Korea, Rep.      Asia  1997   74.647  46173816  15993.527960
850       Korea, Rep.      Asia  2002   77.045  47969150  19233.988180
851       Korea, Rep.      Asia  2007   78.623  49044790  23348.139730

### 불러온 데이터셋 확인

In [3]:
# 상위5개
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [4]:
df.tail()

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
# 크기 (행,렬)
df.shape

(1704, 6)

In [7]:
df.shape[0], df.shape[1]

(1704, 6)

In [8]:
# 데이터프레임의 기본정보
# 데이터개수, 열개수, 열별 non-null개수, 타입, 메모리할당량
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [9]:
# 열(컬럼) 확인
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [12]:
df.columns[0:3]

Index(['country', 'continent', 'year'], dtype='object')

In [13]:
# 열(컬럼)의 자료형
'''
object : 문자열
int64 : 정수
float64 : 실수
dateitime64 : 날짜
'''
df.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [14]:
# 기술통계량(숫자만 출력)
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165877
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846989
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [15]:
# 데이터 개수
df.count()

country      1704
continent    1704
year         1704
lifeExp      1704
pop          1704
gdpPercap    1704
dtype: int64

In [18]:
df['continent'].count()

1704

In [22]:
# 고유값 개수
df['country'].value_counts()

Uganda                    12
Bulgaria                  12
Bahrain                   12
Zambia                    12
Honduras                  12
                          ..
Trinidad and Tobago       12
Netherlands               12
Bosnia and Herzegovina    12
Equatorial Guinea         12
Hungary                   12
Name: country, Length: 142, dtype: int64

In [23]:
# 평균
df['lifeExp'].mean()

59.47443936619713

In [24]:
df.mean()

year         1.979500e+03
lifeExp      5.947444e+01
pop          2.960121e+07
gdpPercap    7.215327e+03
dtype: float64

In [27]:
# 중앙값
df['lifeExp'].median()

60.7125

In [28]:
# 최대값
df['lifeExp'].max()

82.603

In [29]:
# 최소값
df['lifeExp'].min()

23.599

In [30]:
# 분산
df['lifeExp'].var()

166.85166397687874

In [33]:
# 표준편차
df['lifeExp'].std()

12.917107415241182

In [34]:
# 합계
df['lifeExp'].sum()

101344.44467999999

In [35]:
# 상관계수 (-1~1사이의 값)
# 두 컬럼간의 상관계수
# 리턴값이 데이터프레임
df.corr()

               year   lifeExp       pop  gdpPercap
year       1.000000  0.435611  0.082308   0.227318
lifeExp    0.435611  1.000000  0.064955   0.583706
pop        0.082308  0.064955  1.000000  -0.025600
gdpPercap  0.227318  0.583706 -0.025600   1.000000

### 데이터 추출
* 열기준 추출 - 대괄호와 열이름 사용, 작은따옴표, 1개는 시리즈, 2개이상은 데이터프레임으로 추출
* 행단위 추출 - loc(인덱스명으로 추출), iloc(인덱스로 추출)

In [36]:
# country_df변수에 country열 추출해서 대입
country_df = df['country']
type(country_df)

pandas.core.series.Series

In [37]:
country_df.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [38]:
# country_df변수에 열이 country, continent, year 추출해서 대입
country_df = df[['country','continent', 'year']]
country_df

          country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
1699     Zimbabwe    Africa  1987
1700     Zimbabwe    Africa  1992
1701     Zimbabwe    Africa  1997
1702     Zimbabwe    Africa  2002
1703     Zimbabwe    Africa  2007

[1704 rows x 3 columns]

In [41]:
# 행단위 추출
# 0번 인덱스 추출
df.loc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

In [45]:
# 마지막 행 추출
df.loc[df.shape[0]-1]

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [47]:
df.tail(1)

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [48]:
type(df.loc[df.shape[0]-1]), type(df.tail(1))

(pandas.core.series.Series, pandas.core.frame.DataFrame)

In [49]:
# 0, 99, 999 추출
df.iloc[[0,99,999]]

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [50]:
df.loc[[0,99,999]]

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [52]:
df.loc[-1]

KeyError: -1

In [55]:
df.iloc[-1]

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [56]:
# 행,열
df.loc[:,['year','pop']]

      year       pop
0     1952   8425333
1     1957   9240934
2     1962  10267083
3     1967  11537966
4     1972  13079460
...    ...       ...
1699  1987   9216418
1700  1992  10704340
1701  1997  11404948
1702  2002  11926563
1703  2007  12311143

[1704 rows x 2 columns]

In [59]:
# 슬라이싱 전체행, 3번째열~5번째열까지
df.iloc[:,2:5]

      year  lifeExp       pop
0     1952   28.801   8425333
1     1957   30.332   9240934
2     1962   31.997  10267083
3     1967   34.020  11537966
4     1972   36.088  13079460
...    ...      ...       ...
1699  1987   62.351   9216418
1700  1992   60.377  10704340
1701  1997   46.809  11404948
1702  2002   39.989  11926563
1703  2007   43.487  12311143

[1704 rows x 3 columns]

In [61]:
# range 메서드로 추출
type(range(5))

range

In [64]:
list(range(5))

[0, 1, 2, 3, 4]

In [63]:
df.iloc[:,range(5)]

          country continent  year  lifeExp       pop
0     Afghanistan      Asia  1952   28.801   8425333
1     Afghanistan      Asia  1957   30.332   9240934
2     Afghanistan      Asia  1962   31.997  10267083
3     Afghanistan      Asia  1967   34.020  11537966
4     Afghanistan      Asia  1972   36.088  13079460
...           ...       ...   ...      ...       ...
1699     Zimbabwe    Africa  1987   62.351   9216418
1700     Zimbabwe    Africa  1992   60.377  10704340
1701     Zimbabwe    Africa  1997   46.809  11404948
1702     Zimbabwe    Africa  2002   39.989  11926563
1703     Zimbabwe    Africa  2007   43.487  12311143

[1704 rows x 5 columns]

In [67]:
df.iloc[:,:5] # 파이썬 슬라이싱 방법을 더 많이 사용

          country continent  year  lifeExp       pop
0     Afghanistan      Asia  1952   28.801   8425333
1     Afghanistan      Asia  1957   30.332   9240934
2     Afghanistan      Asia  1962   31.997  10267083
3     Afghanistan      Asia  1967   34.020  11537966
4     Afghanistan      Asia  1972   36.088  13079460
...           ...       ...   ...      ...       ...
1699     Zimbabwe    Africa  1987   62.351   9216418
1700     Zimbabwe    Africa  1992   60.377  10704340
1701     Zimbabwe    Africa  1997   46.809  11404948
1702     Zimbabwe    Africa  2002   39.989  11926563
1703     Zimbabwe    Africa  2007   43.487  12311143

[1704 rows x 5 columns]

In [70]:
# 행 0,99,999 열 country, lifeExp, gdpPercap
df.loc[[0,99,999],['country','lifeExp','gdpPercap']]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [71]:
df.iloc[[0,99,999], [0,3,5]]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

### 그룹핑

In [74]:
# 연도별 기대수명 평균
df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [75]:
type(df.groupby('year')['lifeExp'].mean())

pandas.core.series.Series

In [77]:
df.groupby('year')['lifeExp'].mean()[1952]

49.05761971830987

In [78]:
groupyingYear = df.groupby('year')
groupyingYear['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [79]:
gYearLife = df.groupby('year')['lifeExp']
gYearLife.mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [80]:
gYearLifeMean = df.groupby('year')['lifeExp'].mean()
gYearLifeMean[1952]

49.05761971830987

In [82]:
# 연도별, 지역별 기대수명평균, gdp평균
df.groupby(['year','continent'])[['lifeExp','gdpPercap']].mean()

                  lifeExp     gdpPercap
year continent
1952 Africa     39.135500   1252.572466
     Americas   53.279840   4079.062552
     Asia       46.314394   5195.484004
     Europe     64.408500   5661.057435
     Oceania    69.255000  10298.085650
1957 Africa     41.266346   1385.236062
     Americas   55.960280   4616.043733
     Asia       49.318544   5787.732940
     Europe     66.703067   6963.012816
     Oceania    70.295000  11598.522455
1962 Africa     43.319442   1598.078825
     Americas   58.398760   4901.541870
     Asia       51.563223   5729.369625
     Europe     68.539233   8365.486814
     Oceania    71.085000  12696.452430
1967 Africa     45.334538   2050.363801
     Americas   60.410920   5668.253496
     Asia       54.663640   5971.173374
     Europe     69.737600  10143.823757
     Oceania    71.310000  14495.021790
1972 Africa     47.450942   2339.615674
     Americas   62.394920   6491.334139
     Asia       57.319269   8187.468699
     Europe     70.775033  12479.575246
     Oceania    71.910000  16417.333380
1977 Africa     49.580423   2585.938508
     Americas   64.391560   7352.007126
     Asia       59.610556   7791.314020
     Europe     71.937767  14283.979110
     Oceania    72.855000  17283.957605
1982 Africa     51.592865   2481.592960
     Americas   66.228840   7506.737088
     Asia       62.617939   7434.135157
     Europe     72.806400  15617.896551
     Oceania    74.290000  18554.709840
1987 Africa     53.344788   2282.668991
     Americas   68.090720   7793.400261
     Asia       64.851182   7608.226508
     Europe     73.642167  17214.310727
     Oceania    75.320000  20448.040160
1992 Africa     53.629577   2281.810333
     Americas   69.568360   8044.934406
     Asia       66.537212   8639.690248
     Europe     74.440100  17061.568084
     Oceania    76.945000  20894.045885
1997 Africa     53.598269   2378.759555
     Americas   71.150480   8889.300863
     Asia       68.020515   9834.093295
     Europe     75.505167  19076.781802
     Oceania    78.190000  24024.175170
2002 Africa     53.325231   2599.385159
     Americas   72.422040   9287.677107
     Asia       69.233879  10174.090397
     Europe     76.700600  21711.732422
     Oceania    79.740000  26938.778040
2007 Africa     54.806038   3089.032605
     Americas   73.608120  11003.031625
     Asia       70.728485  12473.026870
     Europe     77.648600  25054.481636
     Oceania    80.719500  29810.188275

In [86]:
# 그룹핑한 데이터의 갯수
df.groupby('continent')[['country']].count()

           country
continent
Africa         624
Americas       300
Asia           396
Europe         360
Oceania         24

In [87]:
# 유니크한 갯수
df.groupby('continent')[['country']].nunique()

           country
continent
Africa          52
Americas        25
Asia            33
Europe          30
Oceania          2

In [88]:
# 시리즈 생성
s = pd.Series(['홍길동',30])
s

0    홍길동
1     30
dtype: object

In [89]:
type(s)

pandas.core.series.Series

In [90]:
s = pd.Series(['홍길동',30], index=['name','age'])
s

name    홍길동
age      30
dtype: object

In [91]:
member = pd.DataFrame({
    'name':['홍길동','김길동'],
    'age':[30,40],
    'gender':['male','female']
})

In [92]:
member

  name  age  gender
0  홍길동   30    male
1  김길동   40  female

In [93]:
member = pd.DataFrame({
    'name':['홍길동','김길동'],
    'age':[30,40],
    'gender':['male','female']
}, index=['hong','kim'])
member

     name  age  gender
hong  홍길동   30    male
kim   김길동   40  female

In [95]:
member.loc['hong']

name       홍길동
age         30
gender    male
Name: hong, dtype: object

In [96]:
hong = member.loc['hong']

In [97]:
hong

name       홍길동
age         30
gender    male
Name: hong, dtype: object

In [98]:
# 시리즈의 인덱스
hong.index

Index(['name', 'age', 'gender'], dtype='object')

In [103]:
hong.keys()

Index(['name', 'age', 'gender'], dtype='object')

In [105]:
hong.index[0], hong.keys()[0]

('name', 'name')

In [99]:
# 시리즈의 데이터
hong.values

array(['홍길동', 30, 'male'], dtype=object)

In [102]:
type(hong.values)

numpy.ndarray

In [126]:
df = pd.read_csv('data/scientists.csv')
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [109]:
# 최대나이, 평균나이 출력
df['Age'].max(), df['Age'].mean()

(90, 59.125)

In [111]:
# boolean 연산
# 과학자들 중에 평균나이보다 많은 과학자 출력
df['Age'] > df['Age'].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [113]:
df[df['Age'] > df['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [114]:
f = df['Age'] > df['Age'].mean()
df[f]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

### 브로드캐스팅(broadcasting)
* 모든 값에 개별 연산하는 것

In [116]:
df['Age'] + 10

0     47
1     71
2    100
3     76
4     66
5     55
6     51
7     87
Name: Age, dtype: int64

In [117]:
# 길이가 다른 시리즈 연산
pd.Series([1,10])

0     1
1    10
dtype: int64

In [119]:
# 길이가 다르면, 인덱스가 동일한 값만 연산이 되고, 나머지는 NaN(결측값)
df['Age'] + pd.Series([1,10])

0    38.0
1    71.0
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
dtype: float64

In [127]:
ages = df['Age']
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [131]:
# 정렬
reverse_ages = ages.sort_index(ascending=False)

In [132]:
reverse_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [134]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [141]:
print(df['Born'].dtype)

object

In [142]:
# datetime 자료형으로 변환
born = pd.to_datetime(df['Born'], format='%Y-%m-%d')
born

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [143]:
df['Born'] = born

In [144]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      datetime64[ns]
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 448.0+ bytes

In [145]:
df['Died'] = pd.to_datetime(df['Died'], format='%Y-%m-%d')

In [146]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      datetime64[ns]
 2   Died        8 non-null      datetime64[ns]
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: datetime64[ns](2), int64(1), object(2)
memory usage: 448.0+ bytes

In [147]:
df['Died'] - df['Born']

0   13779 days
1   22404 days
2   32964 days
3   24345 days
4   20777 days
5   16529 days
6   15324 days
7   28422 days
dtype: timedelta64[ns]

In [148]:
# 산일자를 'age_days' 컬럼으로 추가
df['age_days'] = df['Died'] - df['Born']
df

,Name,Born,Died,Age,Occupation,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,28422 days

In [1]:
import pandas as pd

In [12]:
df = pd.read_csv('data/scientists.csv')
ages = df['Age']

In [13]:
# 나중에 동일한 형태로 섞이게 하기 위해 시드값을 지정
import random
random.seed(44) # 시드값
random.shuffle(ages)
ages

0    90
1    45
2    66
3    61
4    37
5    77
6    56
7    41
Name: Age, dtype: int64